Table of Contents
 Interface IAutomation
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
This interface is used for controlling Idea Statica application from external applictions.
[ServiceContract]
public interface IAutomation
Properties
 ProjectDir
string ProjectDir { get; }
Property Value
string
 Status
AutomationStatus Status { get; }
Property Value
AutomationStatus
 TempWorkingDir
string TempWorkingDir { get; }
Property Value
string
Methods
 CloseProject()
Close the
[OperationContract]
void CloseProject()
 NotifyChange()
void NotifyChange()
 OpenProject(string)
Open fileName
[OperationContract]
void OpenProject(string fileName)
Parameters
fileName string
Project to open
 Refresh()
[OperationContract]
void Refresh()
 RefreshProject()
Refresh the currently open project
[OperationContract]
void RefreshProject()
 SelectItem(string)
Select item with itemId in the project
[OperationContract]
void SelectItem(string itemId)
Parameters
itemId string
The identifier of the requested item
 Shutdown()
[OperationContract]
void Shutdown()
 Edit this page